{
  "backend/main.mo": "Empty Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report listing UI updates referencing 'Yono Store' and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file's purpose and content.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry file setting the document title to 'Yono Store' and loading the React app.",
  "frontend/src/App.tsx": "Main React app component managing navigation, theming, and page rendering.",
  "frontend/src/components/Footer.tsx": "Footer component with Yono Store branding, links, legal info, and responsible gaming notices.",
  "frontend/src/components/Header.tsx": "Header component with branding, navigation, search, and Internet Identity login controls.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating a backend actor instance based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider managing Internet Identity login, logout, and state handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching listings, promo codes, news, complaints, and dashboard stats, all currently wired to placeholder logic. Includes a mutation hook for submitting complaints with cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes, applying them globally. Sets default border, background, and text utilities.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider. Renders the main App component and imports global styles.",
  "frontend/src/pages/AdminComplaints.tsx": "Renders an admin interface for viewing, responding to, and approving or rejecting mock complaints. Uses cards, badges, and actions with toast feedback.",
  "frontend/src/pages/AdminDashboard.tsx": "Displays the admin dashboard with navigation, stats, and sidebar behavior. Requires Internet Identity login and lets admins navigate to management pages.",
  "frontend/src/pages/AdminListings.tsx": "Shows a table of mock casino listings with edit/delete actions and status badges. Includes navigation and an option to add new listings.",
  "frontend/src/pages/AdminNews.tsx": "Lists mock news articles with metadata, tags, and edit/delete controls. Provides navigation and an action to add new articles.",
  "frontend/src/pages/AdminPromoCodes.tsx": "Displays mock promo codes with expiration dates and actions for editing or deleting. Includes navigation and a button to add new promo codes.",
  "frontend/src/pages/BonusesPage.tsx": "Displays a list of mock bonus offers with countdown timers and copy-to-clipboard functionality.",
  "frontend/src/pages/CasinoDetailPage.tsx": "Shows detailed casino info including rating, description, pros/cons, reviews, and tabbed sections.",
  "frontend/src/pages/CasinosPage.tsx": "Renders a searchable, filterable, and sortable grid of mock casino listings.",
  "frontend/src/pages/ComplaintsPage.tsx": "Provides a complaint submission form and displays a list of mock complaint cases.",
  "frontend/src/pages/HomePage.tsx": "Presents the homepage with hero section and recommended casino listings.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays a detailed news article with tags, metadata, image, and rich HTML content.",
  "frontend/src/pages/NewsPage.tsx": "React page rendering a featured news article and grid of mock news items with navigation to detail pages.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, typography, animations, and container queries with theme extensions.",
  "project_state.json": "Project metadata describing the site’s goals, architecture, issues, and existing implemented features."
}